{
  "posts": [
    {
      "title": " Which skills are required to use Angular?",
      "text": "Do your applicants know that HTML, CSS, JavaScript, and (of course) Angular knowledge are vital skills required to use Angular? Are they aware that TypeScript and Angular Command Line Interface knowledge is also important, and can they show that they have the required skills to become a skilled addition to your team?",
      "id": 1
    },
    {
      "title": "Which soft skills do Angular developers need?",
      "text": "Some of the crucial soft skills required to be a skilled Angular developer include empathy, time management, communication, and attention to detail. Teamwork is also vital for Angular developers. Do your applicants have the right soft skills to join your organization?",
      "id": 2
    },
    {
      "title": "Describe some benefits of using Angular.",
      "text": "Applicants should know that Angular's strength is that it enables developers to write clean code that’s easy to maintain. They should be aware that Angular provides reusable components and data binding and offers modules that make application creation smoother.",
      "id": 3
    },
    {
      "title": "Explain how Angular is different from AngularJS.",
      "text": "Your candidates should know that while Angular uses TypeScript, AngularJS uses the JavaScript programming language. They should also know that Angular uses different components and directives, while AngularJS supports a model-view-controller (MVC) design. Do your candidates know that Angular supports mobile browsers while AngularJS doesn’t?",
      "id": 4
    },
    {
      "title": "Explain what Angular filters are.",
      "text": "Do your applicants know that developers use Angular filters to filter items from various items in an object array or an array? Can they explain that the filter selects the subset of the items it takes from an array and returns the new array, displaying the item on the UI?",
      "id": 5
    },
    {
      "title": "Explain what a JIT compilation is.",
      "text": "Experienced applicants should know that JIT is short for just-in-time. A JIT compilation is a process that developers use to compile code during the execution of a program rather than before. Applicants may know that JIT is also called dynamic compilation.",
      "id": 6
    },
    {
      "title": "Explain the difference between JIT and AOT compilations.",
      "text": "While JIT works by downloading the compiler and compiling the code before displaying the output in the browser, AOT (ahead-of-time) will have already compiled the code during the application building process. Applicants should know that AOT loading is faster than JIT because compilation in JIT happens at runtime.",
      "id": 7
    },
    {
      "title": "Explain what services do in Angular.",
      "text": "Can your applicants explain that services in Angular complete tasks that multiple components use? Services also complete operational tasks and ensure developers don’t have to rewrite code. Can your applicants give examples of the tasks that Angular services complete, including image fetching and database management?",
      "id": 8
    },
    {
      "title": "Explain what Promises are in Angular.",
      "text": "Advanced Angular developers should know that Promises handle asynchronous events and emit one value at a time. Do they know that Promises execute straightaway after creation? Your candidates may explain that Promises differ from Observables, which handle several asynchronous events over a certain time.",
      "id": 9
    }
  ]
}